backend/tests/stress/reports/20260528-165420/mixed.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/bahtiyarelik/Developer/diploma/backend/tests/stress/scenarios/mixed.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 1m30s max duration (incl. graceful stop):
              * realistic: 80.00 iterations/s for 1m0s (maxVUs: 60-120, gracefulStop: 30s)


running (0m01.0s), 001/060 VUs, 72 complete and 0 interrupted iterations
realistic   [   2% ] 001/060 VUs  0m00.9s/1m0s  80.00 iters/s

running (0m02.0s), 000/060 VUs, 152 complete and 0 interrupted iterations
realistic   [   3% ] 000/060 VUs  0m01.9s/1m0s  80.00 iters/s

running (0m03.0s), 001/060 VUs, 232 complete and 0 interrupted iterations
realistic   [   5% ] 001/060 VUs  0m02.9s/1m0s  80.00 iters/s

running (0m04.0s), 001/060 VUs, 312 complete and 0 interrupted iterations
realistic   [   7% ] 001/060 VUs  0m03.9s/1m0s  80.00 iters/s

running (0m05.0s), 001/060 VUs, 392 complete and 0 interrupted iterations
realistic   [   8% ] 001/060 VUs  0m04.9s/1m0s  80.00 iters/s

running (0m06.0s), 001/060 VUs, 472 complete and 0 interrupted iterations
realistic   [  10% ] 001/060 VUs  0m05.9s/1m0s  80.00 iters/s

running (0m07.0s), 001/060 VUs, 552 complete and 0 interrupted iterations
realistic   [  12% ] 001/060 VUs  0m06.9s/1m0s  80.00 iters/s

running (0m08.0s), 001/060 VUs, 632 complete and 0 interrupted iterations
realistic   [  13% ] 001/060 VUs  0m07.9s/1m0s  80.00 iters/s

running (0m09.0s), 001/060 VUs, 712 complete and 0 interrupted iterations
realistic   [  15% ] 001/060 VUs  0m08.9s/1m0s  80.00 iters/s

running (0m10.0s), 001/060 VUs, 792 complete and 0 interrupted iterations
realistic   [  17% ] 001/060 VUs  0m09.9s/1m0s  80.00 iters/s

running (0m11.0s), 001/060 VUs, 872 complete and 0 interrupted iterations
realistic   [  18% ] 001/060 VUs  0m10.9s/1m0s  80.00 iters/s

running (0m12.0s), 000/060 VUs, 952 complete and 0 interrupted iterations
realistic   [  20% ] 000/060 VUs  0m11.9s/1m0s  80.00 iters/s

running (0m13.0s), 001/060 VUs, 1032 complete and 0 interrupted iterations
realistic   [  22% ] 001/060 VUs  0m12.9s/1m0s  80.00 iters/s

running (0m14.0s), 001/060 VUs, 1112 complete and 0 interrupted iterations
realistic   [  23% ] 001/060 VUs  0m13.9s/1m0s  80.00 iters/s

running (0m15.0s), 000/060 VUs, 1192 complete and 0 interrupted iterations
realistic   [  25% ] 000/060 VUs  0m14.9s/1m0s  80.00 iters/s

running (0m16.0s), 001/060 VUs, 1272 complete and 0 interrupted iterations
realistic   [  27% ] 001/060 VUs  0m15.9s/1m0s  80.00 iters/s

running (0m17.0s), 001/060 VUs, 1352 complete and 0 interrupted iterations
realistic   [  28% ] 001/060 VUs  0m16.9s/1m0s  80.00 iters/s

running (0m18.0s), 001/060 VUs, 1432 complete and 0 interrupted iterations
realistic   [  30% ] 001/060 VUs  0m17.9s/1m0s  80.00 iters/s

running (0m19.0s), 001/060 VUs, 1512 complete and 0 interrupted iterations
realistic   [  32% ] 001/060 VUs  0m18.9s/1m0s  80.00 iters/s

running (0m20.0s), 001/060 VUs, 1592 complete and 0 interrupted iterations
realistic   [  33% ] 001/060 VUs  0m19.9s/1m0s  80.00 iters/s

running (0m21.0s), 001/060 VUs, 1672 complete and 0 interrupted iterations
realistic   [  35% ] 001/060 VUs  0m20.9s/1m0s  80.00 iters/s

running (0m22.0s), 000/060 VUs, 1752 complete and 0 interrupted iterations
realistic   [  37% ] 000/060 VUs  0m21.9s/1m0s  80.00 iters/s

running (0m23.0s), 001/060 VUs, 1832 complete and 0 interrupted iterations
realistic   [  38% ] 001/060 VUs  0m22.9s/1m0s  80.00 iters/s

running (0m24.0s), 001/060 VUs, 1912 complete and 0 interrupted iterations
realistic   [  40% ] 001/060 VUs  0m23.9s/1m0s  80.00 iters/s

running (0m25.0s), 001/060 VUs, 1992 complete and 0 interrupted iterations
realistic   [  42% ] 001/060 VUs  0m24.9s/1m0s  80.00 iters/s

running (0m26.0s), 001/060 VUs, 2072 complete and 0 interrupted iterations
realistic   [  43% ] 001/060 VUs  0m25.9s/1m0s  80.00 iters/s

running (0m27.0s), 001/060 VUs, 2152 complete and 0 interrupted iterations
realistic   [  45% ] 001/060 VUs  0m26.9s/1m0s  80.00 iters/s

running (0m28.0s), 001/060 VUs, 2232 complete and 0 interrupted iterations
realistic   [  47% ] 001/060 VUs  0m27.9s/1m0s  80.00 iters/s

running (0m29.0s), 001/060 VUs, 2312 complete and 0 interrupted iterations
realistic   [  48% ] 001/060 VUs  0m28.9s/1m0s  80.00 iters/s

running (0m30.0s), 000/060 VUs, 2392 complete and 0 interrupted iterations
realistic   [  50% ] 001/060 VUs  0m29.9s/1m0s  80.00 iters/s

running (0m31.0s), 000/060 VUs, 2472 complete and 0 interrupted iterations
realistic   [  52% ] 000/060 VUs  0m30.9s/1m0s  80.00 iters/s

running (0m32.0s), 000/060 VUs, 2552 complete and 0 interrupted iterations
realistic   [  53% ] 000/060 VUs  0m31.9s/1m0s  80.00 iters/s

running (0m33.0s), 001/060 VUs, 2632 complete and 0 interrupted iterations
realistic   [  55% ] 001/060 VUs  0m32.9s/1m0s  80.00 iters/s

running (0m34.0s), 001/060 VUs, 2712 complete and 0 interrupted iterations
realistic   [  57% ] 001/060 VUs  0m33.9s/1m0s  80.00 iters/s

running (0m35.0s), 001/060 VUs, 2792 complete and 0 interrupted iterations
realistic   [  58% ] 001/060 VUs  0m34.9s/1m0s  80.00 iters/s

running (0m36.0s), 001/060 VUs, 2872 complete and 0 interrupted iterations
realistic   [  60% ] 001/060 VUs  0m35.9s/1m0s  80.00 iters/s

running (0m37.0s), 001/060 VUs, 2952 complete and 0 interrupted iterations
realistic   [  62% ] 001/060 VUs  0m36.9s/1m0s  80.00 iters/s

running (0m38.0s), 001/060 VUs, 3032 complete and 0 interrupted iterations
realistic   [  63% ] 001/060 VUs  0m37.9s/1m0s  80.00 iters/s

running (0m39.0s), 001/060 VUs, 3112 complete and 0 interrupted iterations
realistic   [  65% ] 001/060 VUs  0m38.9s/1m0s  80.00 iters/s

running (0m40.0s), 001/060 VUs, 3192 complete and 0 interrupted iterations
realistic   [  67% ] 001/060 VUs  0m39.9s/1m0s  80.00 iters/s

running (0m41.0s), 000/060 VUs, 3272 complete and 0 interrupted iterations
realistic   [  68% ] 000/060 VUs  0m40.9s/1m0s  80.00 iters/s

running (0m42.0s), 001/060 VUs, 3352 complete and 0 interrupted iterations
realistic   [  70% ] 001/060 VUs  0m41.9s/1m0s  80.00 iters/s

running (0m43.0s), 001/060 VUs, 3432 complete and 0 interrupted iterations
realistic   [  72% ] 001/060 VUs  0m42.9s/1m0s  80.00 iters/s

running (0m44.0s), 001/060 VUs, 3512 complete and 0 interrupted iterations
realistic   [  73% ] 001/060 VUs  0m43.9s/1m0s  80.00 iters/s

running (0m45.0s), 000/060 VUs, 3592 complete and 0 interrupted iterations
realistic   [  75% ] 000/060 VUs  0m44.9s/1m0s  80.00 iters/s

running (0m46.0s), 001/060 VUs, 3672 complete and 0 interrupted iterations
realistic   [  77% ] 001/060 VUs  0m45.9s/1m0s  80.00 iters/s

running (0m47.0s), 001/060 VUs, 3752 complete and 0 interrupted iterations
realistic   [  78% ] 001/060 VUs  0m46.9s/1m0s  80.00 iters/s

running (0m48.0s), 001/060 VUs, 3832 complete and 0 interrupted iterations
realistic   [  80% ] 001/060 VUs  0m47.9s/1m0s  80.00 iters/s

running (0m49.0s), 001/060 VUs, 3912 complete and 0 interrupted iterations
realistic   [  82% ] 001/060 VUs  0m48.9s/1m0s  80.00 iters/s

running (0m50.0s), 001/060 VUs, 3992 complete and 0 interrupted iterations
realistic   [  83% ] 001/060 VUs  0m49.9s/1m0s  80.00 iters/s

running (0m51.0s), 001/060 VUs, 4072 complete and 0 interrupted iterations
realistic   [  85% ] 001/060 VUs  0m50.9s/1m0s  80.00 iters/s

running (0m52.0s), 001/060 VUs, 4152 complete and 0 interrupted iterations
realistic   [  87% ] 001/060 VUs  0m51.9s/1m0s  80.00 iters/s

running (0m53.0s), 001/060 VUs, 4232 complete and 0 interrupted iterations
realistic   [  88% ] 001/060 VUs  0m52.9s/1m0s  80.00 iters/s

running (0m54.0s), 001/060 VUs, 4312 complete and 0 interrupted iterations
realistic   [  90% ] 001/060 VUs  0m53.9s/1m0s  80.00 iters/s

running (0m55.0s), 001/060 VUs, 4392 complete and 0 interrupted iterations
realistic   [  92% ] 001/060 VUs  0m54.9s/1m0s  80.00 iters/s

running (0m56.0s), 001/060 VUs, 4472 complete and 0 interrupted iterations
realistic   [  93% ] 001/060 VUs  0m55.9s/1m0s  80.00 iters/s

running (0m57.0s), 001/060 VUs, 4552 complete and 0 interrupted iterations
realistic   [  95% ] 001/060 VUs  0m56.9s/1m0s  80.00 iters/s

running (0m58.0s), 001/060 VUs, 4632 complete and 0 interrupted iterations
realistic   [  97% ] 001/060 VUs  0m57.9s/1m0s  80.00 iters/s

running (0m59.0s), 001/060 VUs, 4712 complete and 0 interrupted iterations
realistic   [  98% ] 001/060 VUs  0m58.9s/1m0s  80.00 iters/s

running (1m00.0s), 001/060 VUs, 4792 complete and 0 interrupted iterations
realistic   [ 100% ] 001/060 VUs  0m59.9s/1m0s  80.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=7.94ms
    ✓ 'p(99)<800' p(99)=12.29ms

    http_req_failed
    ✗ 'rate<0.02' rate=40.12%


  █ TOTAL RESULTS 

    checks_total.......: 4801   79.882048/s
    checks_succeeded...: 59.86% 2874 out of 4801
    checks_failed......: 40.13% 1927 out of 4801

    ✗ catalog 2xx
      ↳  47% — ✓ 1103 / ✗ 1218
    ✗ bookings list 2xx
      ↳  51% — ✓ 496 / ✗ 468
    ✓ me 2xx
    ✗ create booking 2xx
      ↳  51% — ✓ 260 / ✗ 241

    HTTP
    http_req_duration..............: avg=3.15ms min=299µs    med=2.42ms max=85.41ms p(90)=6.56ms p(95)=7.94ms
      { expected_response:true }...: avg=4.52ms min=1.08ms   med=3.96ms max=85.41ms p(90)=7.53ms p(95)=9.29ms
    http_req_failed................: 40.12% 1927 out of 4803
    http_reqs......................: 4803   79.915325/s

    EXECUTION
    iteration_duration.............: avg=3.38ms min=388.87µs med=2.64ms max=25.61ms p(90)=6.88ms p(95)=8.35ms
    iterations.....................: 4801   79.882048/s
    vus............................: 1      min=0            max=1 
    vus_max........................: 60     min=60           max=60

    NETWORK
    data_received..................: 11 MB  175 kB/s
    data_sent......................: 1.3 MB 22 kB/s



running (1m00.1s), 000/060 VUs, 4801 complete and 0 interrupted iterations
realistic ✓ [ 100% ] 000/060 VUs  1m0s  80.00 iters/s